<center><h2>roadmap: pretraitement des données pour la datascience<h2></center>

<center>Charger les bibiotheques nécéssaire pour le pretraitement</center>

In [2]:
import numpy as np #nécéssaire pour les calculs matriciels etc...
import pandas as pd #nécéssaire pour charger le jeu de données
import matplotlib.pyplot as plt #nécéssaire pour tracer des courbes et graphes

<center>Chargerment du dataset</center>

In [3]:
data = pd.read_csv("./../../Datasets/data.csv")

salaryData = pd.read_csv("./../../Datasets/salaryData.csv")

smoking = pd.read_csv("./../../Datasets/smoking.csv")

<center>Cherchons les informations sur les datasets</center>

In [4]:
data.describe()

             Age        Salary
count   9.000000      9.000000
mean   38.777778  63777.777778
std     7.693793  12265.579662
min    27.000000  48000.000000
25%    35.000000  54000.000000
50%    38.000000  61000.000000
75%    44.000000  72000.000000
max    50.000000  83000.000000

In [5]:
"""
Explications des lignes de du tableau renvoyé par data;describe()
-count : fait reference au nombre de valeur presente dans le dataset dans notre cas on a 9 age et 9 salaires dans notre jeu de données
-mean : represente la moyenne de chaque colonne ,ici age et salaire
-std : ecart-type 
-min : La valeur minimale
-25% : le premier quartile
-50% : le deuxieme quartile ou la mediane
-75% : Le troisieme quartile
-max : La valeur maximale de chaque colonne
"""

'\nExplications des lignes de du tableau renvoyé par data;describe()\n-count : fait reference au nombre de valeur presente dans le dataset dans notre cas on a 9 age et 9 salaires dans notre jeu de données\n-mean : represente la moyenne de chaque colonne ,ici age et salaire\n-std : ecart-type \n-min : La valeur minimale\n-25% : le premier quartile\n-50% : le deuxieme quartile ou la mediane\n-75% : Le troisieme quartile\n-max : La valeur maximale de chaque colonne\n'

In [6]:
salaryData.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [7]:
smoking.describe()

               age  amt_weekends  amt_weekdays
count  1691.000000    421.000000    421.000000
mean     49.836192     16.410926     13.750594
std      18.736851      9.892988      9.388292
min      16.000000      0.000000      0.000000
25%      34.000000     10.000000      7.000000
50%      48.000000     15.000000     12.000000
75%      65.500000     20.000000     20.000000
max      97.000000     60.000000     55.000000

<center>Affichage des 5 premieres lignes du dataset pour le visualiser </center>

In [8]:
data.head(5)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [9]:
smoking.head(5)

,gender,age,marital_status,highest_qualification,nationality,ethnicity,gross_income,region,smoke,amt_weekends,amt_weekdays,type
0,Male,38,Divorced,No Qualification,British,White,"2,600 to 5,200",The North,No,NaN,NaN,NaN
1,Female,42,Single,No Qualification,British,White,"Under 2,600",The North,Yes,12.0,12.0,Packets
2,Male,40,Married,Degree,English,White,"28,600 to 36,400",The North,No,NaN,NaN,NaN
3,Female,40,Married,Degree,English,White,"10,400 to 15,600",The North,No,NaN,NaN,NaN
4,Female,39,Married,GCSE/O Level,British,White,"2,600 to 5,200",The North,No,NaN,NaN,NaN

In [10]:
salaryData.head(5)

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

<center><h2>Traitement des valeurs manquantes<h2></center>

<center>Compter les valeurs manquantes dans chaque dataset</center>

In [11]:
data.isna().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [12]:
"""
Donc on a les repartions suivantes:
- colonne country : 0 valeur manquante
- colonne Age : une valeur manquante
- colonne purchased : 0 valeur manquante
"""

'\nDonc on a les repartions suivantes:\n- colonne country : 0 valeur manquante\n- colonne Age : une valeur manquante\n- colonne purchased : 0 valeur manquante\n'

In [13]:
salaryData.isna().sum()

YearsExperience    0
Salary             0
dtype: int64

In [14]:
smoking.isna().sum()

gender                      0
age                         0
marital_status              0
highest_qualification       0
nationality                 0
ethnicity                   0
gross_income                0
region                      0
smoke                       0
amt_weekends             1270
amt_weekdays             1270
type                     1270
dtype: int64

<center>Remplacement des valeurs manquantes contenues dans le jeud de donnée data par la moyenne</center>

In [15]:
data["Age"] = data["Age"].fillna(data["Age"].mean())

data["Salary"] = data["Salary"].fillna(data["Salary"].mean())

data.isna().sum()

Country      0
Age          0
Salary       0
Purchased    0
dtype: int64

In [16]:
data.head(5)

   Country   Age        Salary Purchased
0   France  44.0  72000.000000        No
1    Spain  27.0  48000.000000       Yes
2  Germany  30.0  54000.000000        No
3    Spain  38.0  61000.000000        No
4  Germany  40.0  63777.777778       Yes

<center>Cas du jeu de données smoking</cente>

In [17]:
"""
Les valeurs manquantes que l'on doit traiter sont dans les colonnes :
'amt_weekends' , 'amt_weekdays' et 'type'.
les valeurs des variables des colonnes 'amt_weekends' et 'amt_weekdays' sont numeriques donc on peut remplacer les valeurs manquantes par la moyenne ou autre methode.
la colonn" 'type' quant a elle possede des valeur nominales, donc on peut utilisé le mode.
"""

'\nLes valeurs manquantes que l\'on doit traiter sont dans les colonnes :\n\'amt_weekends\' , \'amt_weekdays\' et \'type\'.\nles valeurs des variables des colonnes \'amt_weekends\' et \'amt_weekdays\' sont numeriques donc on peut remplacer les valeurs manquantes par la moyenne ou autre methode.\nla colonn" \'type\' quant a elle possede des valeur nominales, donc on peut utilisé le mode.\n'

In [ ]:
smoking["amt_weekends"] = smoking["amt_weekends"].fillna(smoking["amt_weekends"].mean())

smoking["amt_weekdays"] = smoking["amt_weekdays"].fillna(smoking["amt_weekdays"].mean())

smoking["type"] = smoking["type"].fillna(smoking["type"].mode()[0]) #mode()[0] permet de ree

smoking.head(5)

,gender,age,marital_status,highest_qualification,nationality,ethnicity,gross_income,region,smoke,amt_weekends,amt_weekdays,type
0,Male,38,Divorced,No Qualification,British,White,"2,600 to 5,200",The North,No,16.410926,13.750594,Packets
1,Female,42,Single,No Qualification,British,White,"Under 2,600",The North,Yes,12.000000,12.000000,Packets
2,Male,40,Married,Degree,English,White,"28,600 to 36,400",The North,No,16.410926,13.750594,Packets
3,Female,40,Married,Degree,English,White,"10,400 to 15,600",The North,No,16.410926,13.750594,Packets
4,Female,39,Married,GCSE/O Level,British,White,"2,600 to 5,200",The North,No,16.410926,13.750594,Packets

In [19]:
smoking.isna().sum()

gender                   0
age                      0
marital_status           0
highest_qualification    0
nationality              0
ethnicity                0
gross_income             0
region                   0
smoke                    0
amt_weekends             0
amt_weekdays             0
type                     0
dtype: int64